let a = prompt('Введите число', '0');
a = Number(a);
if (isNaN(a)) {
    alert('Введенное значение не является числом')
} else {
    if (a % 10 === 0) {
        alert('Дней')
    }
    if (a % 10 === 1 && a !== 111) {
        alert('День')
    }
    if (a % 10 === 2 && a !== 112) {
        alert('Дня')
    }
    if (a % 10 === 3 && a !== 113) {
        alert('Дня')
    }
    if (a % 10 === 4 && a !== 114) {
        alert('Дня')
    }
    if (a % 10 === 5 && a !== 115) {
        alert('Дней')
    }
    if (a % 10 === 6 && a !== 116) {
        alert('Дней')
    }
    if (a % 10 === 7 && a !== 117) {
        alert('Дней')
    }
    if (a % 10 === 8 && a !== 118) {
        alert('Дней')
    }
    if (a % 10 === 9 && a !== 119) {
        alert('Дней')
    }



    if (a % 100 === 11 && a > 20) {
        alert('Дней')
    }
    if (a % 100 === 12 && a > 20) {
        alert('Дней')
    }
    if (a % 100 === 13 && a > 20) {
        alert('Дней')
    }
    if (a % 100 === 14 && a > 20) {
        alert('Дней')
    }
    if (a % 100 === 15 && a > 20) {
        alert('Дней')
    }
    if (a % 100 === 16 && a > 20) {
        alert('Дней')
    }
    if (a % 100 === 17 && a > 20) {
        alert('Дней')
    }
    if (a % 100 === 18 && a > 20) {
        alert('Дней')
    }
    if (a % 100 === 19 && a > 20) {
        alert('Дней')
    }

}
console.log('конец')